<?php

return [
    'public' => [
        'done' => 'اكتملت العملية بنجاح',
        'server_error' => 'حدث خطأ ما، يرجى المحاولة لاحقاً',
        'action_forbidden' => 'ممنوع الوصول',
        'no_data' => 'لم يتم اضافة بيانات بعد',
        'exist' => 'تمت الاضافة مسبقا',
        'exist_not_paid' => 'لقد طلبت هذه الدورة بالفعل ولكنك تحتاج إلى إكمال عملية الدفع',
        'live-message' => 'عملية خاطئة هذه الدورة عبارة عن دورة مسجله وليست مباشرة'
    ],
    'auth' => [
        'validation_error' => 'خطأ في التحقق',
        'invalid_route' => 'الرابط المطلوب غير موجود',
        'method_invalid' => 'العملية غير صالحة',
        'related_resource' => 'تعذر إكمال الطلب بسبب وجود تعارض مع الحالة الحالية للمورد الهدف.',
        'unauthinicated' => 'الرجاء إعادة المصادقة، انتهت الجلسة',
        'login' => 'تم تسجيل الدخول بنجاح',
        'password-min' => 'يجب ان لا تقل كلمة المرور عن 6 خانات',
        'username-required' => 'يرجى ادخال رقم الهاتف',
        'password-required' => 'يرجى ادخال كلمة المرور',
        'rPassword-required' => 'يرجى ادخال تأكيد كلمة المرور',
        'register' => 'تم التسجيل بنجاح',
        'verify_SMS_already' => 'الحساب مؤكّد بالفعل',
        'verify_SMS_done' => 'تم تأكيد الحساب بنجاح',
        'resent_SMS_done' => 'تم إرسال رسالة إلى رقمك بنجاح',
        'forget_password_config' => 'تم إرسال الإعدادات إلى رقمك',
        'loggedout' => 'تم تسجيل الخروج بنجاح',
        'password_reset' => 'تم تهيئة كلمة المرور بنجاح ',
        'password_updated' => 'تم تحديث كلمة السر بنجاح',
        'old_password_incorrect' => 'كلمة المرور السابقة غير صحيحة',
        'code_sent_successfully' => 'تم إرسال الرمز بنجاح',
        'enter_verify_code' => 'ادخل رمز التحقق',
        'verify_code_approved' => 'تم قبول رمز التحقق',
        'invalid_credentials' => 'المعلومات المدخلة غير صحيحة، الرجاء المحاولة مرة أخرى',
        'invalid_cons' => 'يجب أن يكون المدرب المختار والرمز لنفس الشخص',
        'not-acc' => 'نأسف لم يتم قبول طلبك حتى الآن'
    ],
    'verification' => [
        'invalid' => 'رمز التحقق المدخل غير صحيح',
    ],
    'order' => [
        'cancel' => 'تم إلغاء الطلب بنجاح',
        'coupon_expired' => 'الكوبون المدخل غير صحيح أو منتهي الصلاحية',
        'min_max' => 'عدد الزوار اكبر من الحد المسموح به',
        'prevent_cancel' => 'لا يمكن إلغاء الطلب',
        'already_taken' => 'هذا المزرعه محجوزة من قبل زبون آخر في هذه التاريخ',
    ],
    'customer' => [
        'not_found' => 'حساب المستخدم غير موجود',
    ],
    'driver' => [
        'not_found' => 'حساب السائق غير موجود',
    ],
    'redeem' => [
        'limit' => 'تحتاج إلى 10 نقاط على الأقل لإكمال العملية',
    ],
    'social' => [
        'unable_login' => 'لا يمكن تسجيل الدخول باستخدام :service. الرجاء المحاولة لاحقاً'
    ],
    'tawseleh' => [
        'already_taken' => 'هذا الطلب مستخدم حالياً من قبل سائق آخر',
    ],
    'anythingOrder' => [
        'already_taken' => 'هذا الطلب مستخدم حالياً من قبل سائق آخر',
    ],
    'driverSchedule' => [
        'cannot_edit_old_value' => 'لا يمكن تعديل الجدولة السابقة',
    ],
];
